import React from 'react';

const Point: React.SFC = () => {
	return (
		<svg
			xmlns="http://www.w3.org/2000/svg"
			width="25"
			height="18.143"
			viewBox="0 0 25 18.143"
		>
			<g
				id="상벌점_아이콘"
				data-name="상벌점 아이콘"
				transform="translate(0 95.672)"
			>
				<path
					id="패스_247"
					d="M9-46.15a1.689 1.689 0 0 1-1.694 1.69 1.689 1.689 0 0 1-1.688-1.69 1.689 1.689 0 0 1 1.688-1.688A1.689 1.689 0 0 1 9-46.15"
					className="graph"
					data-name="패스 247"
					transform="translate(-4.574 -38.72)"
				/>
				<path
					id="패스_248"
					d="M45.7-77.859a1.689 1.689 0 0 1-1.689 1.689 1.69 1.69 0 0 1-1.689-1.689 1.69 1.69 0 0 1 1.689-1.688 1.69 1.69 0 0 1 1.689 1.688"
					className="graph"
					data-name="패스 248"
					transform="translate(-34.271 -13.053)"
				/>
				<path
					id="패스_249"
					d="M77.635-59.921a1.688 1.688 0 0 1-1.688 1.688 1.688 1.688 0 0 1-1.689-1.688 1.688 1.688 0 0 1 1.689-1.688 1.687 1.687 0 0 1 1.688 1.688"
					className="graph"
					data-name="패스 249"
					transform="translate(-60.13 -27.572)"
				/>
				<path
					id="패스_250"
					d="M111.69-93.983a1.689 1.689 0 0 1-1.69 1.689 1.69 1.69 0 0 1-1.689-1.689A1.69 1.69 0 0 1 110-95.672a1.689 1.689 0 0 1 1.688 1.689"
					className="graph"
					data-name="패스 250"
					transform="translate(-87.681)"
				/>
				<path
					id="패스_251"
					d="M24.052-8.142H.948A.939.939 0 0 1 0-9.071.939.939 0 0 1 .948-10h23.1a.939.939 0 0 1 .952.929.939.939 0 0 1-.948.929"
					className="graph"
					data-name="패스 251"
					transform="translate(0 -69.387)"
				/>
				<path
					id="패스_252"
					d="M11.858-66.766a.649.649 0 0 1-.492-.225.65.65 0 0 1 .067-.917l6.82-5.891a.65.65 0 0 1 .917.067.65.65 0 0 1-.067.917l-6.82 5.891a.647.647 0 0 1-.425.158"
					className="graph"
					data-name="패스 252"
					transform="translate(-9.125 -17.54)"
				/>
				<path
					id="패스_253"
					d="M54.5-69.326a.648.648 0 0 1-.318-.083l-5.932-3.332a.65.65 0 0 1-.25-.886.65.65 0 0 1 .885-.249l5.932 3.332a.651.651 0 0 1 .249.885.65.65 0 0 1-.568.332"
					className="graph"
					data-name="패스 253"
					transform="translate(-38.751 -17.566)"
				/>
				<path
					id="패스_254"
					d="M80.5-82.452a.649.649 0 0 1-.46-.19.65.65 0 0 1 0-.92l6.328-6.328a.65.65 0 0 1 .919 0 .65.65 0 0 1 0 .919l-6.327 6.328a.648.648 0 0 1-.46.19"
					className="graph"
					data-name="패스 254"
					transform="translate(-64.503 -4.553)"
				/>
			</g>
		</svg>
	);
};

export default Point;
