import React from 'react';

const User: React.SFC = () => {
	return (
		<svg
			id="사진"
			xmlns="http://www.w3.org/2000/svg"
			width="144.226"
			height="144.511"
			viewBox="0 0 144.226 144.511"
		>
			<circle
				id="타원_34"
				data-name="타원 34"
				cx="72.113"
				cy="72.113"
				r="72.113"
				fill="#f5f5f5"
			/>
			<path
				id="패스_226"
				data-name="패스 226"
				d="M446.182,689.052a71.767,71.767,0,0,0,39.639-11.863c-2.658-14.522-12.77-15.35-12.77-15.35H417.283s-9.543.783-12.523,14.142A71.782,71.782,0,0,0,446.182,689.052Z"
				transform="translate(-374.002 -544.541)"
				fill="#217ece"
			/>
			<circle
				id="타원_35"
				data-name="타원 35"
				cx="34.807"
				cy="34.807"
				r="34.807"
				transform="translate(36.607 35.786)"
				fill="#333"
			/>
			<path
				id="패스_227"
				data-name="패스 227"
				d="M293.15,476.92h22.3v17.842a11.151,11.151,0,0,1-11.147,11.151h0a11.151,11.151,0,0,1-11.151-11.151V476.92Z"
				transform="translate(-232.969 -377.335)"
				opacity="0.1"
			/>
			<path
				id="패스_228"
				data-name="패스 228"
				d="M293.873,473h20.9a.707.707,0,0,1,.707.707v17.135A11.152,11.152,0,0,1,304.319,502h0a11.151,11.151,0,0,1-11.151-11.151V473.707a.707.707,0,0,1,.7-.707Z"
				transform="translate(-232.985 -374.242)"
				fill="#fdb797"
			/>
			<path
				id="패스_229"
				data-name="패스 229"
				d="M544.34,607.793a32.1,32.1,0,0,0,22.3.061V605.11h-22.3Z"
				transform="translate(-484.119 -499.786)"
				opacity="0.1"
			/>
			<circle
				id="타원_36"
				data-name="타원 36"
				cx="31.968"
				cy="31.968"
				r="31.968"
				transform="translate(39.446 45.564)"
				fill="#fdb797"
			/>
			<path
				id="패스_230"
				data-name="패스 230"
				d="M489.49,305.638s13.473,27.347,51.478,11.466l-8.848-13.874L516.434,297.6Z"
				transform="translate(-440.847 -257.185)"
				opacity="0.1"
			/>
			<path
				id="패스_231"
				data-name="패스 231"
				d="M489.49,303.722s13.473,27.347,51.478,11.462l-8.848-13.874-15.685-5.629Z"
				transform="translate(-440.847 -255.67)"
				fill="#333"
			/>
			<path
				id="패스_232"
				data-name="패스 232"
				d="M486.436,242.55a18.467,18.467,0,0,1,4.578-7.445c6.288-6.216,16.6-7.527,21.885-14.615a4.139,4.139,0,0,1-1.9,5.836c5.066-.034,10.936-.477,13.8-4.644a9.475,9.475,0,0,1-1.6,10.005c4.49.211,9.287,3.251,9.57,7.736.194,2.989-1.689,5.817-4.135,7.531a22.909,22.909,0,0,1-8.35,3.145C511.75,251.985,480.865,259.873,486.436,242.55Z"
				transform="translate(-437.911 -196.351)"
				fill="#333"
			/>
			<ellipse
				id="타원_37"
				data-name="타원 37"
				cx="2.974"
				cy="5.577"
				rx="2.974"
				ry="5.577"
				transform="translate(36.46 71.925)"
				fill="#fdb797"
			/>
			<ellipse
				id="타원_38"
				data-name="타원 38"
				cx="2.974"
				cy="5.577"
				rx="2.974"
				ry="5.577"
				transform="translate(100.404 71.925)"
				fill="#fdb797"
			/>
		</svg>
	);
};

export default User;
